app/views/welcome/index.html.erb

		</tr>
	<% @goal = Goal.find goal.id %>
	<% @goal.amounts.each do |amount| %>
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 3]]
SELECT "amounts".* FROM "amounts" WHERE "amounts"."goal_id" = ?  [["goal_id", 3]]