app/controllers/amounts_controller.rb

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "amounts" ("goal_amount", "points", "goal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["goal_amount", ""], ["points", 0], ["goal_id", 27], ["created_at", "2016-06-19 21:40:26.166012"], ["updated_at", "2016-06-19 21:40:26.166012"]]
---
	def create
		@goal = Goal.find(params[:goal_id])
		@amount = @goal.amounts.create(amount_params)