app/controllers/goals_controller.rb

SELECT "goals".* FROM "goals"
---
	def index
		@goals = Goal.all

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 3]]
---
	def show
		@goal = Goal.find(params[:id])

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 3]]
---
	def edit
		@goal = Goal.find(params[:id])

INSERT INTO "goals" ("title", "test", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "this is a test, world"], ["test", "hello world?"], ["created_at", "2016-06-19 03:58:42.734565"], ["updated_at", "2016-06-19 03:58:42.734565"]]
---
	def create
		@goal = Goal.new(goal_params)

		if @goal.save

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "goals" SET "title" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["title", "teast"], ["updated_at", "2016-06-17 03:33:57.054868"], ["id", 7]]
---
	def update
		@goal = Goal.find(params[:id])

		if @goal.update(goal_params)

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 3]]
---
	def destroy
		@goal = Goal.find(params[:id])
		@goal.destroy