app/controllers/welcome_controller.rb

 def index
		@goals = Goal.all
---
SELECT "goals".* FROM "goals"