app/views/goals/edit.html.erb

SELECT "amounts".* FROM "amounts" WHERE "amounts"."goal_id" = ?  [["goal_id", 30]]
---

<% @goal.amounts.each do |amount| %>