app/views/goals/index.html.erb

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 1]]
SELECT "amounts".* FROM "amounts" WHERE "amounts"."goal_id" = ?  [["goal_id", 3]]
---
		</tr>
	<% @goal = Goal.find goal.id %>
	<% @goal.amounts.each do |amount| %>