app/views/goals/show.html.erb

SELECT "amounts".* FROM "amounts" WHERE "amounts"."goal_id" = ?  [["goal_id", 4]]
---
<h2>Amounts</h2>
<% @goal.amounts.each do |amount| %>